base
base-devel
bat
brightnessctl
efibootmgr
git
grub
hypridle
hyprland
hyprlock
hyprpaper
hyprpolkitagent
intel-ucode
kitty
linux
linux-firmware
neofetch
neovim
networkmanager
openssh
paru
paru-debug
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
rclone
rofi
sddm
sof-firmware
stow
sudo
swaync
ttf-jetbrains-mono
unzip
vim
waybar
wireplumber
xdg-desktop-portal-hyprland
yazi
zen-browser-bin
zsh
zsh-antidote
