abseil-cpp
acl
adwaita-cursors
adwaita-fonts
adwaita-icon-theme
adwaita-icon-theme-legacy
alsa-card-profiles
alsa-lib
alsa-topology-conf
alsa-ucm-conf
aquamarine
archlinux-keyring
atkmm
at-spi2-core
attr
audit
autoconf
automake
avahi
base
base-devel
bash
bat
binutils
bison
bluez-libs
brightnessctl
brotli
bzip2
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
coreutils
cryptsetup
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-glib
dbus-units
dconf
debugedit
default-cursors
desktop-file-utils
device-mapper
diffutils
double-conversion
duktape
e2fsprogs
efibootmgr
efivar
expat
fakeroot
file
filesystem
findutils
flac
flex
fmt
fontconfig
freetype2
fribidi
fuse3
fuse-common
gawk
gc
gcc
gcc-libs
gdbm
gdk-pixbuf2
gettext
giflib
git
glib2
glibc
glibmm
glib-networking
glslang
gmp
gnu-free-fonts
gnulib-l10n
gnupg
gnutls
gperftools
gpgme
gpm
granite
graphene
graphite
grep
groff
grub
gsettings-desktop-schemas
gsettings-system-schemas
gst-plugins-base-libs
gstreamer
gtest
gtk3
gtk-layer-shell
gtkmm3
gtk-update-icon-cache
guile
gzip
harfbuzz
hicolor-icon-theme
highway
hwdata
hyprcursor
hyprgraphics
hypridle
hyprland
hyprland-qt-support
hyprland-qtutils
hyprlang
hyprlock
hyprpaper
hyprpolkitagent
hyprutils
hyprwayland-scanner
iana-etc
icu
intel-ucode
iproute2
iptables
iputils
iso-codes
jansson
jbigkit
json-c
jsoncpp
json-glib
kbd
keyutils
kitty
kitty-shell-integration
kitty-terminfo
kmod
krb5
lame
lcms2
leancrypto
libarchive
libassuan
libasyncns
libb2
libbpf
libbsd
libcap
libcap-ng
libcloudproviders
libcolord
libcups
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdecor
libdisplay-info
libdrm
libebur128
libedit
libei
libelf
libepoxy
libevdev
libevent
libfdk-aac
libffi
libfontenc
libfreeaptx
libgcrypt
libgee
libgit2
libglvnd
libgpg-error
libgudev
libhandy
libice
libidn2
libimobiledevice
libimobiledevice-glue
libinih
libinput
libisl
libjpeg-turbo
libjxl
libksba
liblc3
libldac
libldap
libliftoff
libluv
libmd
libmm-glib
libmnl
libmpc
libmpdclient
libmysofa
libndp
libnetfilter_conntrack
libnewt
libnfnetlink
libnftnl
libnghttp2
libnghttp3
libnl
libnm
libnsl
libogg
libp11-kit
libpcap
libpciaccess
libpgm
libpipewire
libplist
libpng
libproxy
libpsl
libpulse
librsvg
librsync
libsasl
libseccomp
libsecret
libsigc++
libsm
libsndfile
libsodium
libsoup3
libspng
libssh2
libstemmer
libsysprof-capture
libtasn1
libteam
libthai
libtiff
libtirpc
libtool
libunistring
libunwind
libusb
libusbmuxd
libutf8proc
libuv
libverto
libvorbis
libvterm
libwacom
libwebp
libwireplumber
libx11
libxau
libxcb
libxcomposite
libxcrypt
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxmu
libxrandr
libxrender
libxshmfence
libxt
libxtst
libxv
libxxf86vm
libzip
licenses
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-whence
llhttp
llvm-libs
lmdb
lm_sensors
lua
lua51-lpeg
luajit
lv2
lz4
lzo
m4
mailcap
make
md4c
mesa
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
mpdecimal
mpfr
mpg123
msgpack-c
mtdev
ncurses
neovim
nettle
networkmanager
npth
nspr
nss
oniguruma
openssh
openssl
opus
orc
p11-kit
pacman
pacman-mirrorlist
pam
pambase
pango
pangomm
patch
pciutils
pcre
pcre2
pcsclite
perl
perl-error
perl-mailtools
perl-timedate
pinentry
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
pixman
pkgconf
playerctl
polkit
polkit-qt6
popt
procps-ng
psmisc
pugixml
python
qt6-base
qt6-declarative
qt6-svg
qt6-translations
qt6-wayland
rclone
re2
readline
rofi
rtkit
rust
sbc
sdbus-cpp
sddm
seatd
sed
serd
shadow
shared-mime-info
slang
sndio
sof-firmware
sord
spdlog
spirv-tools
sqlite
sratom
startup-notification
stow
sudo
swaync
systemd
systemd-libs
systemd-sysvcompat
tar
texinfo
tinysparql
tomlplusplus
tpm2-tss
tree-sitter
tree-sitter-c
tree-sitter-lua
tree-sitter-markdown
tree-sitter-query
tree-sitter-vim
tree-sitter-vimdoc
tslib
ttf-jetbrains-mono
ttf-nerd-fonts-symbols
ttf-nerd-fonts-symbols-common
tzdata
unibilium
unzip
upower
util-linux
util-linux-libs
vim
vim-runtime
waybar
wayland
wayland-protocols
webrtc-audio-processing-1
which
wireplumber
wpa_supplicant
xcb-imdkit
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-errors
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xdg-desktop-portal
xdg-desktop-portal-hyprland
xdg-utils
xf86-input-libinput
xkeyboard-config
xorg-fonts-encodings
xorgproto
xorg-server
xorg-server-common
xorg-setxkbmap
xorg-xauth
xorg-xkbcomp
xorg-xprop
xorg-xset
xorg-xwayland
xxhash
xz
yazi
zeromq
zix
zlib
zlib-ng
zsh
zstd
