android-file-transfer
apparmor
base
base-devel
bat
brightnessctl
dunst
efibootmgr
firefox
git
grub
hypridle
hyprland
hyprlock
hyprpaper
hyprpicker
intel-ucode
kitty
kwallet
kwalletmanager
linux
linux-firmware
man-db
man-pages
mariadb
nautilus
neofetch
neovim
networkmanager
nm-connection-editor
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
obsidian
pacman-contrib
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
python-audit
python-notify2
python-psutil
python-pywal
qt6-multimedia-ffmpeg
qt6-virtualkeyboard
rofi
sddm
sof-firmware
stow
sudo
swaync
ufw
unzip
vim
vulkan-nouveau
vulkan-tools
waybar
wget
wireplumber
xdg-desktop-portal
xdg-desktop-portal-hyprland
yazi
zsh
