# Pacman explicitly installed packages (native)
# Reinstall with: sudo pacman -S --needed - < pkglist-pacman.txt
7zip
amd-ucode
asusctl
base
base-devel
bat
bitwarden
blueman
bluez
bluez-obex
bluez-utils
brightnessctl
btrfs-assistant
cachyos-keyring
cachyos-mirrorlist
cachyos-settings
cachyos-v3-mirrorlist
cachyos-v4-mirrorlist
cava
chntpw
cliphist
cloudflare-warp-bin
cronie
discord
docker
docker-compose
efibootmgr
eza
fastfetch
fd
fish
fzf
gammastep
gdu
gimp
git
go
gpaste
greetd
greetd-tuigreet
grub
hypridle
hyprland
hyprlock
hyprpolkitagent
hyprshot
hyprsunset
imagemagick
img2pdf
inotify-tools
java-environment-common
java-runtime-common
jdk-openjdk
lazygit
libnet
linux-cachyos-lts
linux-cachyos-lts-headers
linux-firmware
luarocks
man-db
man-pages
mariadb
maven
meson
ncdu
neovim
network-manager-applet
networkmanager
nm-connection-editor
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
npm
ntfs-3g
nvidia-settings
obsidian
openbsd-netcat
openssh
papirus-icon-theme
paru
pavucontrol
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
plymouth
power-profiles-daemon
pv
python-pip
qalculate-gtk
qpdf
qt6-multimedia-ffmpeg
qt6-svg
qt6-virtualkeyboard
rclone
ripgrep
rofi
rog-control-center
sassc
scrcpy
sof-firmware
starship
stow
swaync
swayosd
swww
sxiv
syncthing
texinfo
unixodbc
unzip
variety
waybar
wezterm
wireplumber
wl-clipboard
wofi
xdg-desktop-portal-hyprland
yazi
zathura
zathura-pdf-mupdf
zen-browser-bin
zoxide
